openfoam/4_karman_vortex/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

//bottom left is (0,0,0)
vertices 
(
    (0 0 0) //0
    (0 0.4 0)
    (0 0.6 0)
    (0 1 0)
    (0 0 0.1) //4
    (0 0.4 0.1)
    (0 0.6 0.1)
    (0 1 0.1)
    (0.4 0 0) //8
    (0.4 0.4 0)
    (0.4 0.6 0)
    (0.4 1 0)    
    (0.4 0 0.1) //12
    (0.4 0.4 0.1)
    (0.4 0.6 0.1)
    (0.4 1 0.1)
    (0.6 0 0) //16
    (0.6 0.4 0)
    (0.6 0.6 0)
    (0.6 1 0)
    (0.6 0 0.1) //20
    (0.6 0.4 0.1)
    (0.6 0.6 0.1)
    (0.6 1 0.1)
    (1 0 0) //24
    (1 0.4 0)
    (1 0.6 0)
    (1 1 0)
    (1 0 0.1) //28
    (1 0.4 0.1)
    (1 0.6 0.1)
    (1 1 0.1)
    (5 0 0) //32
    (5 0.4 0)
    (5 0.6 0)
    (5 1 0)
    (5 0 0.1) //36
    (5 0.4 0.1)
    (5 0.6 0.1)
    (5 1 0.1)
);

blocks
(
    hex (0 8 9 1 4 12 13 5) (16 16 1) simpleGrading (1 1 1) //Block I
    hex (8 16 17 9 12 20 21 13) (8 16 1) simpleGrading (1 1 1) //Block II
    hex (16 24 25 17 20 28 29 21) (16 16 1) simpleGrading (1 1 1) //Block III
    hex (24 32 33 25 28 36 37 29) (160 16 1) simpleGrading (1 1 1) //Block IV
    hex (1 9 10 2 5 13 14 6) (16 8 1) simpleGrading (1 1 1) //Block V
    hex (17 25 26 18 21 29 30 22) (16 8 1) simpleGrading (1 1 1) //Block VI
    hex (25 33 34 26 29 37 38 30) (160 8 1) simpleGrading (1 1 1) //Block VII
    hex (2 10 11 3 6 14 15 7) (16 16 1) simpleGrading (1 1 1) //Block VIII
    hex (10 18 19 11 14 22 23 15) (8 16 1) simpleGrading (1 1 1) //Block IX
    hex (18 26 27 19 22 30 31 23) (16 16 1) simpleGrading (1 1 1) //Block X
    hex (26 34 35 27 30 38 39 31) (160 16 1) simpleGrading (1 1 1) //Block XI
);

edges
(
    arc 10 18 (0.5 0.6414 0)
    arc 14 22 (0.5 0.6414 0.1)
    arc 18 17 (0.6414 0.5 0)
    arc 22 21 (0.6414 0.5 0.1)
    arc 17 9 (0.5 0.3586 0)
    arc 21 13 (0.5 0.3586 0.1)
    arc 9 10 (0.3586 0.5 0)
    arc 13 14 (0.3586 0.5 0.1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 5 4) //face of block I
            (1 2 6 5) //face of block V
            (2 3 7 6) //face of block VIII
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (32 33 37 36) //outlet of block IV
            (33 34 38 37) //outlet of block VII
            (34 35 39 38) //outlet of block XI
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (3 7 15 11) //upper wall of block VIII
            (11 15 23 19) //upper wall of block IX
            (19 23 31 27) //upper wall of block X
            (27 31 39 35) //upper wall of block XI
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 4 12 8) //lower wall of block I
            (8 12 20 16) //lower wall of block II
            (16 20 28 24) //lower wall of block III
            (24 28 36 32) //lower wall of block IV
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 8 9 1) //front of block I
            (4 12 13 5) //back of block I
            (8 16 17 9) //front of block II
            (12 20 21 13) //back of block II
            (16 24 25 17) //front of block III
            (20 28 29 21) //back of block III
            (24 32 33 25) //front of block IV
            (28 36 37 29) //back of block IV
            (1 9 10 2) //front of block V
            (5 13 14 6) //back of block V
            // (9 17 18 10) //front of block with cylinder
            // (13 21 22 14) //back of block with cylinder
            (17 25 26 18) //front of block VI
            (21 29 30 22) //back of block VI
            (25 33 34 26) //front of block VII
            (29 37 38 30) //back of block VII
            (2 10 11 3) //front of block VIII
            (6 14 15 7) //back of block VIII
            (10 18 19 11) //front of block IX
            (14 22 23 15) //back of block IX
            (18 26 27 19) //front of block X
            (22 30 31 23) //back of block X
            (26 34 35 27) //front of block XI
            (30 38 39 31) //back of block XI
        );
    }
    cylinder
    {
        type wall;
        faces
        (
            (10 14 22 18) //upper side cylinder
            (18 22 21 17) //right side cylinder
            (17 21 13 9) //lower side cylinder
            (9 13 14 10) //left side cylinder
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
